app/Controllers/LoginController.php

SELECT *
FROM `usuarios`
WHERE `correo` = 'carlos@gmail.com'
 LIMIT 1
---
    public function authenticate()
    {
        $session = session();
        $userModel = new UsuariosModel();

        // Obtener datos del formulario
        $correo = $this->request->getPost('username');  // 'username' es 'correo' en la base de datos
        $password = $this->request->getPost('password');

        // Buscar el usuario por correo
        $user = $userModel->where('correo', $correo)->first();