app/Controllers/VacantesController.php

    public function MostrarVacantes()
    {
        $vacantesModel = new VacantesModel();

        // Realizar la consulta con JOIN para obtener el nombre de la categoría
        $vacantes = $vacantesModel->select('vacantes.*, categorias_empleo.nombre as categoria')
            ->join('categorias_empleo', 'vacantes.id_categoria = categorias_empleo.id')
            ->orderBy('fecha_publicacion', 'DESC')
            ->findAll();
---
SELECT `vacantes`.*, `categorias_empleo`.`nombre` as `categoria`
FROM `vacantes`
JOIN `categorias_empleo` ON `vacantes`.`id_categoria` = `categorias_empleo`.`id`
ORDER BY `fecha_publicacion` DESC

    public function edit($id)
    {
        // Obtener la vacante por su ID
        $vacante = $this->vacantesModel->find($id);
---
SELECT *
FROM `vacantes`
WHERE `vacantes`.`id` = '11'

    public function update($id)
    {
        // Validar los datos del formulario
        $data = [
            'titulo' => $this->request->getPost('titulo'),
            'descripcion' => $this->request->getPost('descripcion'),
            'ubicacion' => $this->request->getPost('ubicacion'),
            'salario' => $this->request->getPost('salario'),
            'id_categoria' => $this->request->getPost('id_categoria'),
            'estado' => $this->request->getPost('estado')
        ];

        // Actualizar la vacante
        $this->vacantesModel->update($id, $data);

        // Pasar el mensaje de éxito a la misma vista
        $vacante = $this->vacantesModel->find($id);
---
UPDATE `vacantes` SET `titulo` = 'Ingeniero/A De Software De Evc Evolución Core De Productos Ti', `descripcion` = 'Velarás por el correcto ciclo de vida del software y de las aplicaciones a su cargo (análisis, diseño, desarrollo, pruebas, soporte, actualización y jubilación), que garantice el cumplimiento de los niveles de disponibilidad, calidad, seguridad y velocidad en las entregas requeridos por la organización, aplicando los lineamientos, estándares y mejores prácticas de TI y la mitigación de los riesgos asociados al desarrollo de software.', `ubicacion` = 'Medellín', `salario` = '$5.000.000', `id_categoria` = '2', `estado` = '1', `fecha_edicion` = '2024-10-10 23:02:55'
WHERE `vacantes`.`id` IN ('11')
SELECT *
FROM `vacantes`
WHERE `vacantes`.`id` = '11'

    public function create()
{
    // Obtener el ID de la empresa desde la sesión
    $id_empresa = session('id');

    // Validar los datos del formulario
    $data = [
        'titulo' => $this->request->getPost('titulo'),
        'descripcion' => $this->request->getPost('descripcion'),
        'ubicacion' => $this->request->getPost('ubicacion'),
        'salario' => $this->request->getPost('salario'),
        'id_categoria' => $this->request->getPost('id_categoria'),
        'estado' => $this->request->getPost('estado'),
        'id_empresa' => $id_empresa // Añadir el ID de la empresa aquí
    ];

    // Crear la nueva vacante
    $this->vacantesModel->insert($data);
---
INSERT INTO `vacantes` (`titulo`, `descripcion`, `ubicacion`, `salario`, `id_categoria`, `estado`, `id_empresa`, `fecha_publicacion`, `fecha_edicion`) VALUES ('Desarrollador', 'Desarrollador full stack ', 'Medellín, bello ', '234000', '1', '1', '2', '2024-10-10 23:02:27', '2024-10-10 23:02:27')