app/Controllers/VacantesControllerEst.php

    public function MostrarVacantes()
    {
        $vacantesModel = new VacantesModel();


        $vacantes = $vacantesModel->select('vacantes.*, categorias_empleo.nombre as categoria, usuarios.nombre as empresa')
        ->join('categorias_empleo', 'vacantes.id_categoria = categorias_empleo.id')
        ->join('usuarios', 'vacantes.id_empresa = usuarios.id') // Aquí no es necesario el alias ya que no hay conflicto
        ->orderBy('fecha_publicacion', 'DESC')
        ->findAll();
---
SELECT `vacantes`.*, `categorias_empleo`.`nombre` as `categoria`, `usuarios`.`nombre` as `empresa`
FROM `vacantes`
JOIN `categorias_empleo` ON `vacantes`.`id_categoria` = `categorias_empleo`.`id`
JOIN `usuarios` ON `vacantes`.`id_empresa` = `usuarios`.`id`
ORDER BY `fecha_publicacion` DESC